app/Controllers/Home.php

    public function index()
    {
        $data = [
            'title' => 'Home | PML - Document Filling',
            'usr_count' => $this->UserModel->get()->getNumRows(),
            'type_kmr_count' => $this->TypeKamarModel->get()->getNumRows(),
            'kmr_count' => $this->KamarModel->get()->getNumRows(),
            'tamu_count' => $this->TamuModel->get()->getNumRows(),
---
SELECT *
FROM `user`
SELECT *
FROM `type_kamar`
SELECT *
FROM `kamar`
SELECT *
FROM `tamu`