app/Controllers/Reservation.php

    public function save_checkin()
    {
        $data = array(
            'invoice'                   => $this->request->getPost('invoice'),
            'tgl_checkin'               => $this->request->getPost('tgl_checkin'),
            'tgl_checkout'              => $this->request->getPost('tgl_checkout'),
            'jml_tamu_dewasa'           => $this->request->getPost('jml_tamu_dewasa'),
            'jml_tamu_anak'             => $this->request->getPost('jml_tamu_anak'),
            'remarks_checkin'           => $this->request->getPost('remarks_checkin'),
            'id_kamar'                  => $this->request->getPost('id_kamar'),
            'id_tamu'                   => $this->request->getPost('id_tamu'),
        );
        $this->CheckInModel->insert_checkin($data);


        $findKamar = $this->KamarModel->find($data['id_kamar']);
---
SELECT *
FROM `kamar`
WHERE `kamar`.`id_kamar` = '1; ?>'