app/Models/CheckOutModel.php

SELECT *
FROM `checkout`
LEFT OUTER JOIN `checkin` ON `checkin`.`id_checkin` = `checkout`.`id_checkin`
LEFT OUTER JOIN `kamar` ON `kamar`.`id_kamar` = `checkin`.`id_kamar`
LEFT OUTER JOIN `tamu` ON `tamu`.`id_tamu` = `checkin`.`id_tamu`
JOIN `type_kamar` ON `type_kamar`.`id_type_kamar` = `kamar`.`id_type_kamar`
---
    public function get_checkout()
    {
        return $this->db->table('checkout')
            ->join('checkin', 'checkin.id_checkin = checkout.id_checkin', 'left outer')
            ->join('kamar', 'kamar.id_kamar = checkin.id_kamar', 'left outer')
            ->join('tamu', 'tamu.id_tamu = checkin.id_tamu', 'left outer')
            ->join('type_kamar', 'type_kamar.id_type_kamar = kamar.id_type_kamar')
            ->get()->getResultArray();