app/Models/CheckInModel.php

SELECT *
FROM `checkin`
LEFT OUTER JOIN `kamar` ON `kamar`.`id_kamar` = `checkin`.`id_kamar`
LEFT OUTER JOIN `tamu` ON `tamu`.`id_tamu` = `checkin`.`id_tamu`
JOIN `type_kamar` ON `type_kamar`.`id_type_kamar` = `kamar`.`id_type_kamar`
---
    public function get_checkin()
    {
        return $this->db->table('checkin')
            ->join('kamar', 'kamar.id_kamar = checkin.id_kamar', 'left outer')
            ->join('tamu', 'tamu.id_tamu = checkin.id_tamu', 'left outer')
            ->join('type_kamar', 'type_kamar.id_type_kamar = kamar.id_type_kamar')
            ->get()->getResultArray();

INSERT INTO `checkin` (`invoice`, `tgl_checkin`, `tgl_checkout`, `jml_tamu_dewasa`, `jml_tamu_anak`, `remarks_checkin`, `id_kamar`, `id_tamu`) VALUES ('INV0001', '2023-06-18', '2023-06-19', '1', '1', '', '1; ?>', '1')
---
    public function insert_checkin($data)
    {
        $query = $this->db->table('checkin')->insert($data);