app/Models/KamarModel.php

    public function get_kamar()
    {
        return $this->db->table('kamar')
            ->join('type_kamar', 'type_kamar.id_type_kamar = kamar.id_type_kamar', 'left outer')
            ->get()->getResultArray();
---
SELECT *
FROM `kamar`
LEFT OUTER JOIN `type_kamar` ON `type_kamar`.`id_type_kamar` = `kamar`.`id_type_kamar`

    public function get_kamar_id($id)
    {
        return $this->db->table('kamar')
            ->join('type_kamar', 'type_kamar.id_type_kamar = kamar.id_type_kamar', 'left outer')
            ->where('id_kamar', $id)
            ->get()->getResultArray();
---
SELECT *
FROM `kamar`
LEFT OUTER JOIN `type_kamar` ON `type_kamar`.`id_type_kamar` = `kamar`.`id_type_kamar`
WHERE `id_kamar` = 'dist'

    public function insert_kamar($data)
    {
        $query = $this->db->table('kamar')->insert($data);
---
INSERT INTO `kamar` (`id_type_kamar`, `kamar`, `max_dewasa`, `max_anak`, `remarks_kamar`) VALUES ('1', 'EXC-001', '2', '2', '')

    public function update_kamar($data, $id)
    {
        $query = $this->db->table('kamar')->update($data, array('id_kamar' => $id));
---
UPDATE `kamar` SET `status_kamar` = 'TERPAKAI'
WHERE `id_kamar` = '1'

    public function delete_kamar($id)
    {
        $query = $this->db->table('kamar')->delete(array('id_kamar' => $id));
---
DELETE FROM `kamar`
WHERE `id_kamar` = '9'