app/Models/TamuModel.php

    public function update_tamu($data, $id)
    {
        $query = $this->db->table('tamu')->update($data, array('id_tamu' => $id));
---
UPDATE `tamu` SET `jenis_identitas` = 'KTP', `no_identitas` = '321', `nama_tamu` = 'Rizky TEST', `warga_negara` = 'WNI', `email` = 'rizky@gmail.com', `phone` = '0812999111', `alamat` = 'JAKARTA', `ket_tamu` = ''
WHERE `id_tamu` = '2'