app/Models/UserModel.php

SELECT *
FROM `user`
---
    public function get_user()
    {
        return $this->db->table('user')->get()->getResultArray();

UPDATE `user` SET `password` = '$2y$10$yAQ37CP3hcwdeJ5zjvUW1.MvcXuI.9m8Z974edtXJxXKh3ULjfjoe'
WHERE `id_user` = '115'
---
    public function update_User($data, $id)
    {
        $query = $this->db->table('user')->update($data, array('id_user' => $id));